Tekla.Structures.ModelInternal.ConversionLink.ConversionStatusEnum
Enum contains the all possible conversion statuses.

Tekla.Structures.ModelInternal.ConversionLink.ConversionStatusEnum.UNKNOWN
Conversion status is unknown

Tekla.Structures.ModelInternal.ConversionLink.ConversionStatusEnum.NOT_CONVERT
No conversion.

Tekla.Structures.ModelInternal.ConversionLink.ConversionStatusEnum.CONVERT
Convert.

Tekla.Structures.ModelInternal.ConversionLink.ConversionStatusEnum.CONVERT_TO_BREP
Convert to BREP.

Tekla.Structures.ModelInternal.ConversionLink.ConversionStatusEnum.CONVERT_TO_EXTRUSION
Convert to extrusion object.